{
  "version": "https://jsonfeed.org/version/1",
  "title": "Indra Pratama Putra",
  "home_page_url": "https://indrapratama.com/",
  "feed_url": "https://indrapratama.com/feed/feed.json",
  "description": "Saya Indra Pratama. Orang yang jatuh ke dunia kenotariatan.",
  "author": {
    "name": "Indra Pratama Putra",
    "url": "https://indrapratama.com/about-me/"
  },
  "items": [{
      "id": "https://indrapratama.com/blogs/cerita-dari-website-ini/",
      "url": "https://indrapratama.com/blogs/cerita-dari-website-ini/",
      "title": "Cerita dari website ini",
      "content_html": "<p>Sudah hampir lima tahun domain <a href=\"http://indrapratama.com\">indrapratama.com</a> ini saya daftarkan. Namun, sampai saat ini website-nya belum juga bisa online karena bebearapa hal. Diantaranya banyaknya perkejaan atau alasan klise &quot;Gak Ada Waktu&quot;.</p>\n<p>Teknologi membangun website kian hari makin canggih. Waktu pertama kali saya tertarik membangun website sekitar 15 tahun lalu ketika masih menjadi mahasiswa. Wordpress, Joomla, PHP adalah buku awal yang saya beli untuk membangun sebuah website. Tapi suatu kesalahan jika belajar dimulai dari itu semua, karena semua harus dimulai dari bahasa resmi website yaitu HTML. (Akhirnya pusing sendiri)</p>\n<p>Website yang ingin saya buat, kira-kira seperti ini :</p>\n<ol>\n<li>Hostingnya pengen Gratis (Gak mau modal :D)</li>\n<li>Designnya Simple yang penting enak dibaca di semua device</li>\n<li>Ga lemot</li>\n<li>Kalo bisa SPA (Single Page Application)</li>\n</ol>\n<p>Akhirnya setelah keliling-keliling baca artikel lalu trial end error, ini tools yang saya gunakan untuk membuat website ini :</p>\n<ol>\n<li><a href=\"https://www.11ty.dev\">11ty</a></li>\n<li><a href=\"https://www.prepros.io\">Prepros</a></li>\n<li><a href=\"https://www.github.com\">Github</a></li>\n</ol>\n<h3 id=\"prepros\">Prepros <a class=\"direct-link\" href=\"#prepros\">#</a></h3>\n<p>Saat ini Node.JS adalah salah satu tools wajib yang dibutuhkan oleh frontend developer. Livereloading, autoprefix css, auto minify dan masih banyak fitur lain yang sangat membantu developer. Saya sudah lama menggunakan Node.JS and really love it. Tapi, hal yang saya kurang suka dari NodeJS adalah harus download Repository setiap memulai project baru. Untuk sekedar membuat website yang simple seperti web-saya ini, saya menggunakan Prepros.</p>\n<p>Prepros adalah favorit saya dalam membuat website yang tidak terlalu rumit. Prepros juga menggunakan NodeJS sebagai base-nya, tapi dengan prepros, saya tidak perlu repot download repository atau setup project. Cukup drag folder project saya, dan Prepros sudah memproses SCSS, JS, HTML, Pug dan lainnya.</p>\n<h3 id=\"11ty-(eleventy)-static-website-generator\">11ty (Eleventy) Static Website Generator <a class=\"direct-link\" href=\"#11ty-(eleventy)-static-website-generator\">#</a></h3>\n<p>Saya memilih github pages sebagai hosting website. It`s free and fast, tapi github pages hanya bisa static website jadi tidak bisa hosting CMS seperti wordpress. Biar tidak repot coding untuk setiap kali post, saya memilih 11ty sebagai static generator.</p>\n",
      "date_published": "2020-08-07T17:00:00+07:00"
    },{
      "id": "https://indrapratama.com/jurnal/materai-dan-sahnya-perjanjian/",
      "url": "https://indrapratama.com/jurnal/materai-dan-sahnya-perjanjian/",
      "title": "Materai dan Sah-nya Perjanjian",
      "content_html": "<p>Beberapa waktu (sudah cukup lama) lalu saya melihat sebuat tayangan berita tentang praktek jual beli anak. Dalam liputan si yang membeli anak tersebut memperlihatkan perjanjian jual beli anak yang dilakukan diatas materai, dan saya juga pernah membaca artikel di internet tentang siswa yang akan masuk SMA di Bandung, wajib menandatangani surat pernyataan bukan anggota gangster diatas materai.</p>\n<p>Dalam masyarakat terdapat anggapan bahwa sah atau tidaknya suatu perjanjian itu ditentukan oleh apakah perjanjian tersebut ditandatangani di atas materai atau tidak. Sebenarnya apakah fungsi materai itu ? apakah perjanjian atau surat pernyataan yang tidak ditandatangani diatas materai itu tidak sah ?</p>\n<p>Materai adalah istilah yang lazim di gunakan oleh masyarakat, istilah lengkapnya adalah BEA MATERAI. kata “BEA” berarti pajak tidak langsung, jadi materai adalah pajak tidak langsung yang dikenakan terhadap suatu dokumen baik itu perjanjian atau dokumen-dokumen lain. dengan menempelkan materai diatas perjanjian, artinya para pihak yang melaksanakan perjanjian tersebut telah membayar pajak atas pembuatan dokumen perjanjian yang ditanda-tanganinya.</p>\n<p>Dokumen yang dikenakan bea materai antara lain (lengkapnya bisa lihat PP no.24 tahun 2000) :</p>\n<ul>\n<li>Surat perjanjian, surat pernyataan dan surat yang dibuat untuk tujuan pembuktian</li>\n<li>Akta Notaris dan Akta PPAT</li>\n<li>Surat yang memuat jumlah uang</li>\n<li>Surat berharga</li>\n<li>dokumen yang digunakan sebagai alat pembuktian di pengadilan.</li>\n</ul>\n<p>Jadi bea materai adalah pembayaran pajak atas dokumen, tidak ada hubungannya dengan sah atau tidaknya suatu perjanjian.</p>\n<h3 id=\"syarat-sah-nya-perjanjian\">Syarat Sah-nya Perjanjian <a class=\"direct-link\" href=\"#syarat-sah-nya-perjanjian\">#</a></h3>\n<p>Hal-hal yang menyebabkan batal / tidak sahnya suatu perjanjian adalah apabila perjanjian itu melanggar pasal 1320 KUHPerdata. Yaitu :</p>\n<ul>\n<li>Sepakat (yang melakukan perjanjian tidak dalam tekanan)</li>\n<li>Cakap (yang melakukan perjanjian cukup umur / 18 tahun)</li>\n<li>Suatu hal tertentu (yang diperjanjikan harus jelas) dan</li>\n<li>Suatu sebab yang halal (yang diperjanjikan tidak melanggar undang-undang)</li>\n</ul>\n<p>Jika kita hubungkan dengan contoh diawal maka perjanjian jual beli anak meskipun dilaksanakan diatas materai tetap tidak sah karena jual beli anak sendiri dilarang oleh undang-undang. Sedangkan surat pernyataan bukan anggota gangster yang wajib ditanda-tangani siswa yang akan masuk SMA dapat dibatalkan oleh pengadilan karena siswa yang menandatangani masih dibawah umur (asusmsi rata-rata siswa yang akan masuk SMA berusia 15-16 tahun), seharusnya adalah surat pernyataan dari orang tua/ wali siswa tersebut yang menyatakan bahwa anaknya bukan anggota gangster. (karena anak dibawah umur masih dalam tanggungjawab orang tuanya)</p>\n<p>Suatu perjanjian tetap sah walaupun tidak ditandatangani diatas materai, asalkan tidak melanggar ketentuan pasal 1320 KUHPerdata. Namun, jika dokumen perjanjian yang dilaksanakan tanpa materai tersebut akan dijadikan sebagai alat bukti, maka harus membayar/melunasi materai yang tidak dibayar di kantorpos dengan membayar denda 200% dari bea materai.</p>\n",
      "date_published": "2012-07-11T17:00:00+07:00"
    }
  ]
}
